# Reading data
Read the train.csv file as a pandas dataframe.

In [6]:
import pandas as pd
train = pd.read_csv('data/train.csv')
train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# Indexing
1. Create a function that returns the name of a passenger given their PassengerId.
2. Create a function that returns the PassengerId of a passenger given their Name.
3. Print a message with the ID of passenger **Montvila, Rev. Juozas** with the following format: 'The ID pf passenger Montvila, Rev. Juozas is ##'
4. Print a message with the name of the passenger with ID **42** with the following format: 'The passenger with ID 42 is X'

In [55]:
def id_to_name(df: pd.DataFrame, id: int) -> str:
    """_summary_

    Args:
        df (pd.DataFrame): El dataframe de pandas
        id (int): El id del pasajero

    Returns:
        str: Nombre del pasajero
    """
    return df[df.PassengerId == id].Name.values[0]


def name_to_id(df: pd.DataFrame, name: str) -> int:
    """_summary_

    Args:
        df (pd.DataFrame): El dataframe de pandas
        name (str): El nombre del pasajero

    Returns:
        int: El id del pasajero
    """
    return df[df.Name == name].PassengerId.values[0]

# Test the functions
name_to_id(train, 'Montvila, Rev. Juozas')
id_to_name(train, 10)

# Print message for Montvila, Rev. Juozas
name_id = name_to_id(train, 'Montvila, Rev. Juozas')
print(f'The Id of passanger Montvila, Rev. Juozas is {name_id}')

# Print message for passenger with ID 42
name_name = id_to_name(train, 42)
print(f'The name of passanger with ID 42 is {name_name}')

The Id of passanger Montvila, Rev. Juozas is 887
The name of passanger with ID 42 is Turpin, Mrs. William John Robert (Dorothy Ann Wonnacott)

5. Print all information about the oldest passenger.

In [59]:
max_age = train['Age'].max()
print(f"The maximum age on the Titanic was {max_age} years")

# Find all passengers with that age
oldest_passengers = train[train['Age'] == max_age]

# Display full information about the oldest passenger(s)
print(f"\nThere {'was' if len(oldest_passengers) == 1 else 'were'} {len(oldest_passengers)} passenger(s) with this age:")
print("\nFull information about the oldest passenger(s):")
display(oldest_passengers)

The maximum age on the Titanic was 80.0 years

There was 1 passenger(s) with this age:

Full information about the oldest passenger(s):

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0,A23,S

# Subseting
We are asked to share data for analysis by a third party. Since our dataset contains personal details, we only want to share with them the following information: ticket classes, fares and port of embarkation. We are asked to deliver a sample of the first 100 rows of this dataset.

6.⁠ ⁠Create and save the new dataset in *data/port_fares.csv*.

In [76]:
# Create a subset of the data with only ticket classes, fares, and port of embarkation
subset_df = train[['Pclass', 'Fare', 'Embarked']]

# Take only the first 100 rows
subset_df_100 = subset_df.head(100)

# Save to CSV file in the data directory
subset_df_100.to_csv('data/port_fares.csv', index= False) # index= False to not save the row numbers

# Display the first 10 rows of the subset
display(subset_df_100.head(10))

   Pclass     Fare Embarked
0       3   7.2500        S
1       1  71.2833        C
2       3   7.9250        S
3       1  53.1000        S
4       3   8.0500        S
5       3   8.4583        Q
6       1  51.8625        S
7       3  21.0750        S
8       3  11.1333        S
9       2  30.0708        C

# Counting
7. We want to know if there were any survivors over the age of 60, print all of their information.
8. How many people over 60 survived?
9. What percentage of people over 60 survived?

# Women and children first?
10. Find out if women and children were more likely to survive.

11. Write a function that returns the percentage of people that survived from a subset given as a boolean Pandas series.

# Summarizing

12. What is the median age of the passengers?
13. How many passengers embarked from each port?

14. Generate two hypotheses about how does the survival rate differ among groups of passengers. Write your code to explore both hypotheses.